Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.0.23/atdf/ATSAML22N17A.atdf
        <module name="DMAC" id="U2223" version="2.2.2">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x41008000"/>
            <parameters>
              <param name="CH_BITS" value="4" caption="Number of bits to select channel"/>
              <param name="CH_NUM" value="16" caption="Number of channels"/>
              <param name="EVIN_NUM" value="4" caption="Number of input events"/>
              <param name="EVOUT_NUM" value="4" caption="Number of output events"/>
              <param name="LVL_BITS" value="2" caption="Number of bit to select level priority"/>
              <param name="LVL_NUM" value="4" caption="Enable priority level number"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2" caption="QOS dmac ahb interface reset value"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2" caption="QOS dmac fetch interface reset value"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2" caption="QOS dmac write back interface reset value"/>
              <param name="TRIG_BITS" value="6" caption="Number of bits to select trigger source"/>
              <param name="TRIG_NUM" value="40" caption="Number of peripheral triggers"/>
              <param name="INSTANCE_ID" value="36"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2209" version="2.5.0.1">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="U2254" version="2.0.2">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40002800"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA16"/>
              <signal group="EXTINT" index="0" function="A" pad="PB00"/>
              <signal group="EXTINT" index="0" function="A" pad="PB16"/>
              <signal group="EXTINT" index="0" function="A" pad="PC08"/>
              <signal group="EXTINT" index="0" function="A" pad="PC24"/>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="1" function="A" pad="PA17"/>
              <signal group="EXTINT" index="1" function="A" pad="PB01"/>
              <signal group="EXTINT" index="1" function="A" pad="PB17"/>
              <signal group="EXTINT" index="1" function="A" pad="PC09"/>
              <signal group="EXTINT" index="1" function="A" pad="PC25"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA18"/>
              <signal group="EXTINT" index="2" function="A" pad="PB02"/>
              <signal group="EXTINT" index="2" function="A" pad="PB18"/>
              <signal group="EXTINT" index="2" function="A" pad="PC10"/>
              <signal group="EXTINT" index="2" function="A" pad="PC26"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA19"/>
              <signal group="EXTINT" index="3" function="A" pad="PB03"/>
              <signal group="EXTINT" index="3" function="A" pad="PB19"/>
              <signal group="EXTINT" index="3" function="A" pad="PC11"/>
              <signal group="EXTINT" index="3" function="A" pad="PC27"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA20"/>
              <signal group="EXTINT" index="4" function="A" pad="PB04"/>
              <signal group="EXTINT" index="4" function="A" pad="PB20"/>
              <signal group="EXTINT" index="4" function="A" pad="PC12"/>
              <signal group="EXTINT" index="4" function="A" pad="PC28"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA21"/>
              <signal group="EXTINT" index="5" function="A" pad="PB05"/>
              <signal group="EXTINT" index="5" function="A" pad="PB21"/>
              <signal group="EXTINT" index="5" function="A" pad="PC13"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA22"/>
              <signal group="EXTINT" index="6" function="A" pad="PB06"/>
              <signal group="EXTINT" index="6" function="A" pad="PB22"/>
              <signal group="EXTINT" index="6" function="A" pad="PC14"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PA23"/>
              <signal group="EXTINT" index="7" function="A" pad="PB07"/>
              <signal group="EXTINT" index="7" function="A" pad="PB23"/>
              <signal group="EXTINT" index="7" function="A" pad="PC15"/>
              <signal group="EXTINT" index="8" function="A" pad="PB08"/>
              <signal group="EXTINT" index="8" function="A" pad="PB24"/>
              <signal group="EXTINT" index="8" function="A" pad="PC00"/>
              <signal group="EXTINT" index="8" function="A" pad="PC16"/>
              <signal group="EXTINT" index="9" function="A" pad="PA09"/>
              <signal group="EXTINT" index="9" function="A" pad="PB09"/>
              <signal group="EXTINT" index="9" function="A" pad="PB25"/>
              <signal group="EXTINT" index="9" function="A" pad="PC01"/>
              <signal group="EXTINT" index="9" function="A" pad="PC17"/>
              <signal group="EXTINT" index="10" function="A" pad="PA10"/>
              <signal group="EXTINT" index="10" function="A" pad="PA30"/>
              <signal group="EXTINT" index="10" function="A" pad="PC02"/>
              <signal group="EXTINT" index="10" function="A" pad="PC18"/>
              <signal group="EXTINT" index="11" function="A" pad="PA11"/>
              <signal group="EXTINT" index="11" function="A" pad="PA31"/>
              <signal group="EXTINT" index="11" function="A" pad="PB11"/>
              <signal group="EXTINT" index="11" function="A" pad="PC03"/>
              <signal group="EXTINT" index="11" function="A" pad="PC19"/>
              <signal group="EXTINT" index="12" function="A" pad="PA12"/>
              <signal group="EXTINT" index="12" function="A" pad="PA24"/>
              <signal group="EXTINT" index="12" function="A" pad="PB12"/>
              <signal group="EXTINT" index="12" function="A" pad="PC20"/>
              <signal group="EXTINT" index="13" function="A" pad="PA13"/>
              <signal group="EXTINT" index="13" function="A" pad="PA25"/>
              <signal group="EXTINT" index="13" function="A" pad="PB13"/>
              <signal group="EXTINT" index="13" function="A" pad="PC05"/>
              <signal group="EXTINT" index="13" function="A" pad="PC21"/>
              <signal group="EXTINT" index="14" function="A" pad="PB14"/>
              <signal group="EXTINT" index="14" function="A" pad="PB30"/>
              <signal group="EXTINT" index="14" function="A" pad="PC06"/>
              <signal group="EXTINT" index="14" function="A" pad="PA14"/>
              <signal group="EXTINT" index="15" function="A" pad="PA27"/>
              <signal group="EXTINT" index="15" function="A" pad="PB15"/>
              <signal group="EXTINT" index="15" function="A" pad="PB31"/>
              <signal group="EXTINT" index="15" function="A" pad="PC07"/>
              <signal group="EXTINT" index="15" function="A" pad="PA15"/>
              <signal group="NMI" function="A" pad="PA08"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16"/>
              <param name="GCLK_ID" value="3"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16"/>
              <param name="INSTANCE_ID" value="10"/>
            </parameters>
          </instance>
        </module>
